Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HAINT_HAINT          (0xFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HAINT_HAINT_0        (0x1u<<0)

// OTG_HS_HAINTMSK Configuration

#define OTG_HS_HOST_OTG_HS_HAINTMSK_HAINTM      (0xFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HAINTMSK_HAINTM_0    (0x1u<<0)

// OTG_HS_HPRT Configuration

#define OTG_HS_HOST_OTG_HS_HPRT_PSPD            (0x3u<<17)
#define OTG_HS_HOST_OTG_HS_HPRT_PSPD_0          (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HPRT_PTCTL           (0xFu<<13)
#define OTG_HS_HOST_OTG_HS_HPRT_PTCTL_0         (0x1u<<13)
#define OTG_HS_HOST_OTG_HS_HPRT_PPWR            (0x1u<<12)
#define OTG_HS_HOST_OTG_HS_HPRT_PLSTS           (0x3u<<10)
#define OTG_HS_HOST_OTG_HS_HPRT_PLSTS_0         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HPRT_PRST            (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HPRT_PSUSP           (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HPRT_PRES            (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HPRT_POCCHNG         (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HPRT_POCA            (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HPRT_PENCHNG         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HPRT_PENA            (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HPRT_PCDET           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HPRT_PCSTS           (0x1u<<0)

// OTG_HS_HCCHAR0 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR0_CHENA        (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_CHDIS        (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_ODDFRM       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_DAD          (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_DAD_0        (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_MC           (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_MC_0         (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPTYP        (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPTYP_0      (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_LSDEV        (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPDIR        (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPNUM        (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_EPNUM_0      (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_MPSIZ        (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR0_MPSIZ_0      (0x1u<<0)

// OTG_HS_HCSPLT0 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT0_SPLITEN      (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_COMPLSPLT    (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_XACTPOS      (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_XACTPOS_0    (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_HUBADDR      (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_HUBADDR_0    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_PRTADDR      (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT0_PRTADDR_0    (0x1u<<0)

// OTG_HS_HCINT0 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT0_DTERR         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT0_FRMOR         (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT0_BBERR         (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT0_TXERR         (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT0_NYET          (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT0_ACK           (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT0_NAK           (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT0_STALL         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT0_AHBERR        (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT0_CHH           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT0_XFRC          (0x1u<<0)

// OTG_HS_HCINTMSK0 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK0_DTERRM     (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_FRMORM     (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_BBERRM     (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_TXERRM     (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_NYET       (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_ACKM       (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_NAKM       (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_STALLM     (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_AHBERR     (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_CHHM       (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK0_XFRCM      (0x1u<<0)

// OTG_HS_HCTSIZ0 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ0_DPID         (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_DPID_0       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT       (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_PKTCNT_0     (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ       (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ0_XFRSIZ_0     (0x1u<<0)

// OTG_HS_HCDMA0 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA0_DMAADDR       (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA0_DMAADDR_0     (0x1u<<0)

// OTG_HS_HCCHAR1 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR1_CHENA        (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_CHDIS        (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_ODDFRM       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_DAD          (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_DAD_0        (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_MC           (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_MC_0         (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPTYP        (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPTYP_0      (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_LSDEV        (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPDIR        (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPNUM        (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_EPNUM_0      (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_MPSIZ        (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR1_MPSIZ_0      (0x1u<<0)

// OTG_HS_HCSPLT1 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT1_SPLITEN      (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_COMPLSPLT    (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_XACTPOS      (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_XACTPOS_0    (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_HUBADDR      (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_HUBADDR_0    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_PRTADDR      (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT1_PRTADDR_0    (0x1u<<0)

// OTG_HS_HCINT1 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT1_DTERR         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT1_FRMOR         (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT1_BBERR         (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT1_TXERR         (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT1_NYET          (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT1_ACK           (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT1_NAK           (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT1_STALL         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT1_AHBERR        (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT1_CHH           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT1_XFRC          (0x1u<<0)

// OTG_HS_HCINTMSK1 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK1_DTERRM     (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_FRMORM     (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_BBERRM     (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_TXERRM     (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_NYET       (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_ACKM       (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_NAKM       (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_STALLM     (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_AHBERR     (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_CHHM       (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK1_XFRCM      (0x1u<<0)

// OTG_HS_HCTSIZ1 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ1_DPID         (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_DPID_0       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT       (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_PKTCNT_0     (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ       (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ1_XFRSIZ_0     (0x1u<<0)

