Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_otg_hs_host.h
// OTG_HS_HCDMA1 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA1_DMAADDR       (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA1_DMAADDR_0     (0x1u<<0)

// OTG_HS_HCCHAR2 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR2_CHENA        (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_CHDIS        (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_ODDFRM       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_DAD          (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_DAD_0        (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_MC           (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_MC_0         (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPTYP        (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPTYP_0      (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_LSDEV        (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPDIR        (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPNUM        (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_EPNUM_0      (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_MPSIZ        (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR2_MPSIZ_0      (0x1u<<0)

// OTG_HS_HCSPLT2 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT2_SPLITEN      (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_COMPLSPLT    (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_XACTPOS      (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_XACTPOS_0    (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_HUBADDR      (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_HUBADDR_0    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_PRTADDR      (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT2_PRTADDR_0    (0x1u<<0)

// OTG_HS_HCINT2 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT2_DTERR         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT2_FRMOR         (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT2_BBERR         (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT2_TXERR         (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT2_NYET          (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT2_ACK           (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT2_NAK           (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT2_STALL         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT2_AHBERR        (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT2_CHH           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT2_XFRC          (0x1u<<0)

// OTG_HS_HCINTMSK2 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK2_DTERRM     (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_FRMORM     (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_BBERRM     (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_TXERRM     (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_NYET       (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_ACKM       (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_NAKM       (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_STALLM     (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_AHBERR     (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_CHHM       (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK2_XFRCM      (0x1u<<0)

// OTG_HS_HCTSIZ2 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ2_DPID         (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_DPID_0       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT       (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_PKTCNT_0     (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ       (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ2_XFRSIZ_0     (0x1u<<0)

// OTG_HS_HCDMA2 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA2_DMAADDR       (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA2_DMAADDR_0     (0x1u<<0)

// OTG_HS_HCCHAR3 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR3_CHENA        (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_CHDIS        (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_ODDFRM       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_DAD          (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_DAD_0        (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_MC           (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_MC_0         (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPTYP        (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPTYP_0      (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_LSDEV        (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPDIR        (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPNUM        (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_EPNUM_0      (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_MPSIZ        (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR3_MPSIZ_0      (0x1u<<0)

// OTG_HS_HCSPLT3 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT3_SPLITEN      (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_COMPLSPLT    (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_XACTPOS      (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_XACTPOS_0    (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_HUBADDR      (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_HUBADDR_0    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_PRTADDR      (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT3_PRTADDR_0    (0x1u<<0)

// OTG_HS_HCINT3 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT3_DTERR         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT3_FRMOR         (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT3_BBERR         (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT3_TXERR         (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT3_NYET          (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT3_ACK           (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT3_NAK           (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT3_STALL         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT3_AHBERR        (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT3_CHH           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT3_XFRC          (0x1u<<0)

// OTG_HS_HCINTMSK3 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK3_DTERRM     (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_FRMORM     (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_BBERRM     (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_TXERRM     (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_NYET       (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_ACKM       (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_NAKM       (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_STALLM     (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_AHBERR     (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_CHHM       (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK3_XFRCM      (0x1u<<0)

// OTG_HS_HCTSIZ3 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ3_DPID         (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_DPID_0       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT       (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_PKTCNT_0     (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ       (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ3_XFRSIZ_0     (0x1u<<0)

// OTG_HS_HCDMA3 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA3_DMAADDR       (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA3_DMAADDR_0     (0x1u<<0)

// OTG_HS_HCCHAR4 Configuration

