Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_otg_hs_host.h
#define OTG_HS_HOST_OTG_HS_HCDMA5_DMAADDR       (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA5_DMAADDR_0     (0x1u<<0)

// OTG_HS_HCCHAR6 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR6_CHENA        (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_CHDIS        (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_ODDFRM       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_DAD          (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_DAD_0        (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_MC           (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_MC_0         (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPTYP        (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPTYP_0      (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_LSDEV        (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPDIR        (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPNUM        (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_EPNUM_0      (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_MPSIZ        (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR6_MPSIZ_0      (0x1u<<0)

// OTG_HS_HCSPLT6 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT6_SPLITEN      (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_COMPLSPLT    (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_XACTPOS      (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_XACTPOS_0    (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_HUBADDR      (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_HUBADDR_0    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_PRTADDR      (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT6_PRTADDR_0    (0x1u<<0)

// OTG_HS_HCINT6 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT6_DTERR         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT6_FRMOR         (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT6_BBERR         (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT6_TXERR         (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT6_NYET          (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT6_ACK           (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT6_NAK           (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT6_STALL         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT6_AHBERR        (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT6_CHH           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT6_XFRC          (0x1u<<0)

// OTG_HS_HCINTMSK6 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK6_DTERRM     (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_FRMORM     (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_BBERRM     (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_TXERRM     (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_NYET       (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_ACKM       (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_NAKM       (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_STALLM     (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_AHBERR     (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_CHHM       (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK6_XFRCM      (0x1u<<0)

// OTG_HS_HCTSIZ6 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ6_DPID         (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_DPID_0       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT       (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_PKTCNT_0     (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ       (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ6_XFRSIZ_0     (0x1u<<0)

// OTG_HS_HCDMA6 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA6_DMAADDR       (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA6_DMAADDR_0     (0x1u<<0)

// OTG_HS_HCCHAR7 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR7_CHENA        (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_CHDIS        (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_ODDFRM       (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_DAD          (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_DAD_0        (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_MC           (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_MC_0         (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_EPTYP        (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_EPTYP_0      (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_LSDEV        (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_EPDIR        (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_EPNUM        (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_EPNUM_0      (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_MPSIZ        (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR7_MPSIZ_0      (0x1u<<0)

// OTG_HS_HCSPLT7 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT7_SPLITEN      (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_COMPLSPLT    (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_XACTPOS      (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_XACTPOS_0    (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_HUBADDR      (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_HUBADDR_0    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_PRTADDR      (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT7_PRTADDR_0    (0x1u<<0)

// OTG_HS_HCINT7 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT7_DTERR         (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT7_FRMOR         (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT7_BBERR         (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT7_TXERR         (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT7_NYET          (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT7_ACK           (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT7_NAK           (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT7_STALL         (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT7_AHBERR        (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT7_CHH           (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT7_XFRC          (0x1u<<0)

// OTG_HS_HCINTMSK7 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK7_DTERRM     (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_FRMORM     (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_BBERRM     (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_TXERRM     (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_NYET       (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_ACKM       (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_NAKM       (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_STALLM     (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_AHBERR     (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_CHHM       (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK7_XFRCM      (0x1u<<0)

