Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32F207/Includes/Registers/stm32F217_otg_hs_host.h
// OTG_HS_HCCHAR10 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR10_CHENA       (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_CHDIS       (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_ODDFRM      (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_DAD         (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_DAD_0       (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_MC          (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_MC_0        (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_EPTYP       (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_EPTYP_0     (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_LSDEV       (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_EPDIR       (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_EPNUM       (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_EPNUM_0     (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_MPSIZ       (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR10_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT10 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT10_SPLITEN     (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_COMPLSPLT   (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_XACTPOS     (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_XACTPOS_0   (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_HUBADDR     (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_HUBADDR_0   (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_PRTADDR     (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT10_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT10 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT10_DTERR        (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT10_FRMOR        (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT10_BBERR        (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT10_TXERR        (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT10_NYET         (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT10_ACK          (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT10_NAK          (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT10_STALL        (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT10_AHBERR       (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT10_CHH          (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT10_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK10 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK10_DTERRM    (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_FRMORM    (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_BBERRM    (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_TXERRM    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_NYET      (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_ACKM      (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_NAKM      (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_STALLM    (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_AHBERR    (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_CHHM      (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK10_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ10 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ10_DPID        (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_DPID_0      (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT      (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_PKTCNT_0    (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ      (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ10_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA10 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA10_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA10_DMAADDR_0    (0x1u<<0)

// OTG_HS_HCCHAR11 Configuration

#define OTG_HS_HOST_OTG_HS_HCCHAR11_CHENA       (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_CHDIS       (0x1u<<30)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_ODDFRM      (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_DAD         (0x7Fu<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_DAD_0       (0x1u<<22)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_MC          (0x3u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_MC_0        (0x1u<<20)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPTYP       (0x3u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPTYP_0     (0x1u<<18)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_LSDEV       (0x1u<<17)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPDIR       (0x1u<<15)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPNUM       (0xFu<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_EPNUM_0     (0x1u<<11)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_MPSIZ       (0x7FFu<<0)
#define OTG_HS_HOST_OTG_HS_HCCHAR11_MPSIZ_0     (0x1u<<0)

// OTG_HS_HCSPLT11 Configuration

#define OTG_HS_HOST_OTG_HS_HCSPLT11_SPLITEN     (0x1u<<31)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_COMPLSPLT   (0x1u<<16)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_XACTPOS     (0x3u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_XACTPOS_0   (0x1u<<14)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_HUBADDR     (0x7Fu<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_HUBADDR_0   (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_PRTADDR     (0x7Fu<<0)
#define OTG_HS_HOST_OTG_HS_HCSPLT11_PRTADDR_0   (0x1u<<0)

// OTG_HS_HCINT11 Configuration

#define OTG_HS_HOST_OTG_HS_HCINT11_DTERR        (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINT11_FRMOR        (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINT11_BBERR        (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINT11_TXERR        (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINT11_NYET         (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINT11_ACK          (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINT11_NAK          (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINT11_STALL        (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINT11_AHBERR       (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINT11_CHH          (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINT11_XFRC         (0x1u<<0)

// OTG_HS_HCINTMSK11 Configuration

#define OTG_HS_HOST_OTG_HS_HCINTMSK11_DTERRM    (0x1u<<10)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_FRMORM    (0x1u<<9)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_BBERRM    (0x1u<<8)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_TXERRM    (0x1u<<7)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_NYET      (0x1u<<6)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_ACKM      (0x1u<<5)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_NAKM      (0x1u<<4)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_STALLM    (0x1u<<3)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_AHBERR    (0x1u<<2)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_CHHM      (0x1u<<1)
#define OTG_HS_HOST_OTG_HS_HCINTMSK11_XFRCM     (0x1u<<0)

// OTG_HS_HCTSIZ11 Configuration

#define OTG_HS_HOST_OTG_HS_HCTSIZ11_DPID        (0x3u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_DPID_0      (0x1u<<29)
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT      (0x3FFu<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_PKTCNT_0    (0x1u<<19)
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ      (0x7FFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCTSIZ11_XFRSIZ_0    (0x1u<<0)

// OTG_HS_HCDMA11 Configuration

#define OTG_HS_HOST_OTG_HS_HCDMA11_DMAADDR      (0xFFFFFFFFu<<0)
#define OTG_HS_HOST_OTG_HS_HCDMA11_DMAADDR_0    (0x1u<<0)
